package pindxru

import (
	"errors"
	"strings"
)

type regions []struct {
	Name     string
	Code     int
	Autonomy bool
}

func (r regions) GetCode(region string) (code int, autonomy bool) {
	if region == "" {
		return
	}
	region = strings.ToUpper(region)
	for _, item := range r {
		if item.Name == region {
			return item.Code, item.Autonomy
		}
	}
	return
}

// GetName возвращает название региона по его коду
func (r regions) GetName(code int) (name string) {
	if code <= 0 {
		return
	}
	for _, item := range r {
		if item.Code == code {
			return item.Name
		}
	}
	return
}

func (r regions) FindCode(region string, autonomy string) int {
	if region == "" {
		region = autonomy
	}
	code, _ := Regions.GetCode(region)
	return code
}

// Regions содержит список регионов.
var Regions = regions{
	{Name: "МОСКВА", Code: 77},
	{Name: "МОСКОВСКАЯ ОБЛАСТЬ", Code: 50},
	{Name: "АДЫГЕЯ РЕСПУБЛИКА", Code: 1},
	{Name: "АЛТАЙ РЕСПУБЛИКА", Code: 4},
	{Name: "АЛТАЙСКИЙ КРАЙ", Code: 22},
	{Name: "АМУРСКАЯ ОБЛАСТЬ", Code: 28},
	{Name: "АРХАНГЕЛЬСКАЯ ОБЛАСТЬ", Code: 29},
	{Name: "АСТРАХАНСКАЯ ОБЛАСТЬ", Code: 30},
	{Name: "БАШКОРТОСТАН РЕСПУБЛИКА", Code: 2},
	{Name: "БЕЛГОРОДСКАЯ ОБЛАСТЬ", Code: 31},
	{Name: "БРЯНСКАЯ ОБЛАСТЬ", Code: 32},
	{Name: "БУРЯТИЯ РЕСПУБЛИКА", Code: 3},
	{Name: "ВЛАДИМИРСКАЯ ОБЛАСТЬ", Code: 33},
	{Name: "ВОЛГОГРАДСКАЯ ОБЛАСТЬ", Code: 34},
	{Name: "ВОЛОГОДСКАЯ ОБЛАСТЬ", Code: 35},
	{Name: "ВОРОНЕЖСКАЯ ОБЛАСТЬ", Code: 36},
	{Name: "ДАГЕСТАН РЕСПУБЛИКА", Code: 5},
	{Name: "ЗАБАЙКАЛЬСКИЙ КРАЙ", Code: 75},
	{Name: "ИВАНОВСКАЯ ОБЛАСТЬ", Code: 37},
	{Name: "ИНГУШЕТИЯ РЕСПУБЛИКА", Code: 6},
	{Name: "ИРКУТСКАЯ ОБЛАСТЬ", Code: 38},
	{Name: "КАБАРДИНО-БАЛКАРСКАЯ РЕСПУБЛИКА", Code: 7},
	{Name: "КАЛИНИНГРАДСКАЯ ОБЛАСТЬ", Code: 39},
	{Name: "КАЛМЫКИЯ РЕСПУБЛИКА", Code: 8},
	{Name: "КАЛУЖСКАЯ ОБЛАСТЬ", Code: 40},
	{Name: "КАМЧАТСКИЙ КРАЙ", Code: 41},
	{Name: "КАРАЧАЕВО-ЧЕРКЕССКАЯ РЕСПУБЛИКА", Code: 9},
	{Name: "КАРЕЛИЯ РЕСПУБЛИКА", Code: 10},
	{Name: "КЕМЕРОВСКАЯ ОБЛАСТЬ", Code: 42},
	{Name: "КИРОВСКАЯ ОБЛАСТЬ", Code: 43},
	{Name: "КОМИ РЕСПУБЛИКА", Code: 11},
	{Name: "КОСТРОМСКАЯ ОБЛАСТЬ", Code: 44},
	{Name: "КРАСНОДАРСКИЙ КРАЙ", Code: 23},
	{Name: "КРАСНОЯРСКИЙ КРАЙ", Code: 24},
	{Name: "КРЫМ РЕСПУБЛИКА", Code: 82},
	{Name: "КУРГАНСКАЯ ОБЛАСТЬ", Code: 45},
	{Name: "КУРСКАЯ ОБЛАСТЬ", Code: 46},
	{Name: "ЛЕНИНГРАДСКАЯ ОБЛАСТЬ", Code: 47},
	{Name: "ЛИПЕЦКАЯ ОБЛАСТЬ", Code: 48},
	{Name: "МАГАДАНСКАЯ ОБЛАСТЬ", Code: 49},
	{Name: "МАРИЙ ЭЛ РЕСПУБЛИКА", Code: 12},
	{Name: "МОРДОВИЯ РЕСПУБЛИКА", Code: 13},
	{Name: "МУРМАНСКАЯ ОБЛАСТЬ", Code: 51},
	{Name: "НИЖЕГОРОДСКАЯ ОБЛАСТЬ", Code: 52},
	{Name: "НОВГОРОДСКАЯ ОБЛАСТЬ", Code: 53},
	{Name: "НОВОСИБИРСКАЯ ОБЛАСТЬ", Code: 54},
	{Name: "ОМСКАЯ ОБЛАСТЬ", Code: 55},
	{Name: "ОРЕНБУРГСКАЯ ОБЛАСТЬ", Code: 56},
	{Name: "ОРЛОВСКАЯ ОБЛАСТЬ", Code: 57},
	{Name: "ПЕНЗЕНСКАЯ ОБЛАСТЬ", Code: 58},
	{Name: "ПЕРМСКИЙ КРАЙ", Code: 59},
	{Name: "ПРИМОРСКИЙ КРАЙ", Code: 25},
	{Name: "ПСКОВСКАЯ ОБЛАСТЬ", Code: 60},
	{Name: "РОСТОВСКАЯ ОБЛАСТЬ", Code: 61},
	{Name: "РЯЗАНСКАЯ ОБЛАСТЬ", Code: 62},
	{Name: "САМАРСКАЯ ОБЛАСТЬ", Code: 63},
	{Name: "САНКТ-ПЕТЕРБУРГ", Code: 78},
	{Name: "САРАТОВСКАЯ ОБЛАСТЬ", Code: 64},
	{Name: "САХА (ЯКУТИЯ) РЕСПУБЛИКА", Code: 14},
	{Name: "САХАЛИНСКАЯ ОБЛАСТЬ", Code: 65},
	{Name: "СВЕРДЛОВСКАЯ ОБЛАСТЬ", Code: 66},
	{Name: "СЕВАСТОПОЛЬ", Code: 92},
	{Name: "СЕВЕРНАЯ ОСЕТИЯ - АЛАНИЯ РЕСПУБЛИКА", Code: 15},
	{Name: "СМОЛЕНСКАЯ ОБЛАСТЬ", Code: 67},
	{Name: "СТАВРОПОЛЬСКИЙ КРАЙ", Code: 26},
	{Name: "ТАМБОВСКАЯ ОБЛАСТЬ", Code: 68},
	{Name: "ТАТАРСТАН РЕСПУБЛИКА", Code: 16},
	{Name: "ТВЕРСКАЯ ОБЛАСТЬ", Code: 69},
	{Name: "ТОМСКАЯ ОБЛАСТЬ", Code: 70},
	{Name: "ТУЛЬСКАЯ ОБЛАСТЬ", Code: 71},
	{Name: "ТЫВА РЕСПУБЛИКА", Code: 17},
	{Name: "ТЮМЕНСКАЯ ОБЛАСТЬ", Code: 72},
	{Name: "УДМУРТСКАЯ РЕСПУБЛИКА", Code: 18},
	{Name: "ХАБАРОВСКИЙ КРАЙ", Code: 27},
	{Name: "ХАКАСИЯ РЕСПУБЛИКА", Code: 19},
	{Name: "ЧЕЛЯБИНСКАЯ ОБЛАСТЬ", Code: 74},
	{Name: "ЧЕЧЕНСКАЯ РЕСПУБЛИКА", Code: 20},
	{Name: "ЧУВАШИЯ РЕСПУБЛИКА", Code: 21},
	{Name: "ЯРОСЛАВСКАЯ ОБЛАСТЬ", Code: 76},
	{Name: "УЛЬЯНОВСКАЯ ОБЛАСТЬ", Code: 73},
	{Name: "НЕНЕЦКИЙ АВТОНОМНЫЙ ОКРУГ", Code: 83, Autonomy: true},
	{Name: "ХАНТЫ-МАНСИЙСКИЙ-ЮГРА АВТОНОМНЫЙ ОКРУГ", Code: 86, Autonomy: true},
	{Name: "ЯМАЛО-НЕНЕЦКИЙ АВТОНОМНЫЙ ОКРУГ", Code: 89, Autonomy: true},
	{Name: "ЕВРЕЙСКАЯ АВТОНОМНАЯ ОБЛАСТЬ", Code: 79, Autonomy: true},
	{Name: "ЧУКОТСКИЙ АВТОНОМНЫЙ ОКРУГ", Code: 87, Autonomy: true},
}

func FindRegionCodeByIndex(index string) (code int, err error) {
	if len(index) < 3 {
		err = errors.New("Minimum 3 digits required. ")
		return
	}
	var ok bool
	if code, ok = postalCodes[index[0:3]]; ok {
		return
	}
	err = errors.New("Not found. ")
	return
}

var postalCodes = map[string]int{
	// МОСКВА
	"101": 77,
	"102": 77,
	"103": 77,
	"104": 77,
	"105": 77,
	"106": 77,
	"107": 77,
	"108": 77,
	"109": 77,
	"110": 77,
	"111": 77,
	"112": 77,
	"113": 77,
	"114": 77,
	"115": 77,
	"116": 77,
	"117": 77,
	"118": 77,
	"119": 77,
	"120": 77,
	"121": 77,
	"122": 77,
	"123": 77,
	"124": 77,
	"125": 77,
	"126": 77,
	"127": 77,
	"128": 77,
	"129": 77,
	"130": 77,
	"131": 77,
	"132": 77,
	"133": 77,
	"134": 77,
	"135": 77,
	// МОСКОВСКАЯ ОБЛАСТЬ
	"140": 50,
	"141": 50,
	"142": 50,
	"143": 50,
	"144": 50,
	// АДЫГЕЯ РЕСПУБЛИКА
	"385": 1,
	// АЛТАЙ РЕСПУБЛИКА
	"649": 4,
	// АЛТАЙСКИЙ КРАЙ
	"656": 22,
	"657": 22,
	"658": 22,
	"659": 22,
	// АМУРСКАЯ ОБЛАСТЬ
	"675": 28,
	"676": 28,
	// АРХАНГЕЛЬСКАЯ ОБЛАСТЬ
	"163": 29,
	"164": 29,
	"165": 29,
	// АСТРАХАНСКАЯ ОБЛАСТЬ
	"414": 30,
	"415": 30,
	"416": 30,
	// БАШКОРТОСТАН РЕСПУБЛИКА
	"450": 2,
	"451": 2,
	"452": 2,
	"453": 2,
	// БЕЛГОРОДСКАЯ ОБЛАСТЬ
	"308": 31,
	"309": 31,
	// БРЯНСКАЯ ОБЛАСТЬ
	"241": 32,
	"242": 32,
	"243": 32,
	// БУРЯТИЯ РЕСПУБЛИКА
	"670": 3,
	"671": 3,
	// ВЛАДИМИРСКАЯ ОБЛАСТЬ
	"600": 33,
	"601": 33,
	"602": 33,
	// ВОЛГОГРАДСКАЯ ОБЛАСТЬ
	"400": 34,
	"401": 34,
	"402": 34,
	"403": 34,
	"404": 34,
	// ВОЛОГОДСКАЯ ОБЛАСТЬ
	"160": 35,
	"161": 35,
	"162": 35,
	// ВОРОНЕЖСКАЯ ОБЛАСТЬ
	"394": 36,
	"395": 36,
	"396": 36,
	"397": 36,
	// ДАГЕСТАН РЕСПУБЛИКА
	"367": 5,
	"368": 5,
	// ЕВРЕЙСКАЯ АВТОНОМНАЯ ОБЛАСТЬ
	"679": 79,
	// ЗАБАЙКАЛЬСКИЙ КРАЙ
	"672": 75,
	"673": 75,
	"674": 75,
	"687": 75,
	// ИВАНОВСКАЯ ОБЛАСТЬ
	"153": 37,
	"154": 37,
	"155": 37,
	// ИНГУШЕТИЯ РЕСПУБЛИКА
	"386": 6,
	// ИРКУТСКАЯ ОБЛАСТЬ
	"664": 38,
	"665": 38,
	"666": 38,
	"669": 38,
	// КАБАРДИНО-БАЛКАРСКАЯ РЕСПУБЛИКА
	"360": 7,
	"361": 7,
	// КАЛИНИНГРАДСКАЯ ОБЛАСТЬ
	"236": 39,
	"237": 39,
	"238": 39,
	// КАЛМЫКИЯ РЕСПУБЛИКА
	"358": 8,
	"359": 8,
	// КАЛУЖСКАЯ ОБЛАСТЬ
	"248": 40,
	"249": 40,
	// КАМЧАТСКИЙ КРАЙ
	"683": 41,
	"684": 41,
	"688": 41,
	// КАРАЧАЕВО-ЧЕРКЕССКАЯ РЕСПУБЛИКА
	"369": 9,
	// КАРЕЛИЯ РЕСПУБЛИКА
	"185": 10,
	"186": 10,
	// КЕМЕРОВСКАЯ ОБЛАСТЬ
	"650": 42,
	"651": 42,
	"652": 42,
	"653": 42,
	"654": 42,
	// КИРОВСКАЯ ОБЛАСТЬ
	"610": 43,
	"611": 43,
	"612": 43,
	"613": 43,
	// КОМИ РЕСПУБЛИКА
	"167": 11,
	"168": 11,
	"169": 11,
	// КОСТРОМСКАЯ ОБЛАСТЬ
	"156": 44,
	"157": 44,
	// КРАСНОДАРСКИЙ КРАЙ
	"350": 23,
	"351": 23,
	"352": 23,
	"353": 23,
	"354": 23,
	// КРАСНОЯРСКИЙ КРАЙ
	"660": 24,
	"661": 24,
	"662": 24,
	"663": 24,
	"647": 24,
	"648": 24,
	// КРЫМ РЕСПУБЛИКА
	"295": 82,
	"296": 82,
	"297": 82,
	"298": 82,
	// КУРГАНСКАЯ ОБЛАСТЬ
	"640": 45,
	"641": 45,
	// КУРСКАЯ ОБЛАСТЬ
	"305": 46,
	"306": 46,
	"307": 46,
	// ЛЕНИНГРАДСКАЯ ОБЛАСТЬ
	"187": 47,
	"188": 47,
	// ЛИПЕЦКАЯ ОБЛАСТЬ
	"398": 48,
	"399": 48,
	// МАГАДАНСКАЯ ОБЛАСТЬ
	"685": 49,
	"686": 49,
	// МАРИЙ ЭЛ РЕСПУБЛИКА
	"424": 12,
	"425": 12,
	// МОРДОВИЯ РЕСПУБЛИКА
	"430": 13,
	"431": 13,
	// МУРМАНСКАЯ ОБЛАСТЬ
	"183": 51,
	"184": 51,
	// НЕНЕЦКИЙ АВТОНОМНЫЙ ОКРУГ
	"166": 83,
	// НИЖЕГОРОДСКАЯ ОБЛАСТЬ
	"603": 52,
	"604": 52,
	"605": 52,
	"606": 52,
	"607": 52,
	// НОВГОРОДСКАЯ ОБЛАСТЬ
	"173": 53,
	"174": 53,
	"175": 53,
	// НОВОСИБИРСКАЯ ОБЛАСТЬ
	"630": 54,
	"631": 54,
	"632": 54,
	"633": 54,
	// ОМСКАЯ ОБЛАСТЬ
	"644": 55,
	"645": 55,
	"646": 55,
	// ОРЕНБУРГСКАЯ ОБЛАСТЬ
	"460": 56,
	"461": 56,
	"462": 56,
	// ОРЛОВСКАЯ ОБЛАСТЬ
	"302": 57,
	"303": 57,
	// ПЕНЗЕНСКАЯ ОБЛАСТЬ
	"440": 58,
	"441": 58,
	"442": 58,
	// ПЕРМСКИЙ КРАЙ
	"614": 59,
	"615": 59,
	"616": 59,
	"617": 59,
	"618": 59,
	"619": 59,
	// ПРИМОРСКИЙ КРАЙ
	"690": 25,
	"691": 25,
	"692": 25,
	// ПСКОВСКАЯ ОБЛАСТЬ
	"180": 60,
	"181": 60,
	"182": 60,
	// РОСТОВСКАЯ ОБЛАСТЬ
	"344": 61,
	"345": 61,
	"346": 61,
	"347": 61,
	// РЯЗАНСКАЯ ОБЛАСТЬ
	"390": 62,
	"391": 62,
	// САМАРСКАЯ ОБЛАСТЬ
	"443": 63,
	"444": 63,
	"445": 63,
	"446": 63,
	// САНКТ-ПЕТЕРБУРГ
	"190": 78,
	"191": 78,
	"192": 78,
	"193": 78,
	"194": 78,
	"195": 78,
	"196": 78,
	"197": 78,
	"198": 78,
	"199": 78,
	// САРАТОВСКАЯ ОБЛАСТЬ
	"410": 64,
	"411": 64,
	"412": 64,
	"413": 64,
	// САХА (ЯКУТИЯ) РЕСПУБЛИКА
	"677": 14,
	"678": 14,
	// САХАЛИНСКАЯ ОБЛАСТЬ
	"693": 65,
	"694": 65,
	// СВЕРДЛОВСКАЯ ОБЛАСТЬ
	"620": 66,
	"621": 66,
	"622": 66,
	"623": 66,
	"624": 66,
	// СЕВАСТОПОЛЬ
	"299": 92,
	// СЕВЕРНАЯ ОСЕТИЯ - АЛАНИЯ РЕСПУБЛИКА
	"362": 15,
	"363": 15,
	// СМОЛЕНСКАЯ ОБЛАСТЬ
	"214": 67,
	"215": 67,
	"216": 67,
	// СТАВРОПОЛЬСКИЙ КРАЙ
	"355": 26,
	"356": 26,
	"357": 26,
	// ТАМБОВСКАЯ ОБЛАСТЬ
	"392": 68,
	"393": 68,
	// ТАТАРСТАН РЕСПУБЛИКА
	"420": 16,
	"421": 16,
	"422": 16,
	"423": 16,
	// ТВЕРСКАЯ ОБЛАСТЬ
	"170": 69,
	"171": 69,
	"172": 69,
	// ТОМСКАЯ ОБЛАСТЬ
	"634": 70,
	"635": 70,
	"636": 70,
	// ТУЛЬСКАЯ ОБЛАСТЬ
	"300": 71,
	"301": 71,
	// ТЫВА РЕСПУБЛИКА
	"667": 17,
	"668": 17,
	// ТЮМЕНСКАЯ ОБЛАСТЬ
	"625": 72,
	"626": 72,
	"627": 72,
	"629": 72,
	// УДМУРТСКАЯ РЕСПУБЛИКА
	"426": 18,
	"427": 18,
	// ХАБАРОВСКИЙ КРАЙ
	"680": 27,
	"681": 27,
	"682": 27,
	// ХАКАСИЯ РЕСПУБЛИКА
	"655": 19,
	// ХАНТЫ-МАНСИЙСКИЙ-ЮГРА АВТОНОМНЫЙ ОКРУГ
	"628": 86,
	// ЧЕЛЯБИНСКАЯ ОБЛАСТЬ
	"454": 74,
	"455": 74,
	"456": 74,
	"457": 74,
	// ЧЕЧЕНСКАЯ РЕСПУБЛИКА
	"364": 20,
	"365": 20,
	"366": 20,
	// ЧУВАШИЯ РЕСПУБЛИКА
	"428": 21,
	"429": 21,
	// ЯРОСЛАВСКАЯ ОБЛАСТЬ
	"150": 76,
	"151": 76,
	"152": 76,
	// УЛЬЯНОВСКАЯ ОБЛАСТЬ
	"432": 73,
	"433": 73,
	// ЧУКОТСКИЙ АВТОНОМНЫЙ ОКРУГ
	"689": 87,
}
